# 6. Средний элемент

Рассмотрим три числа a, b и c. Упорядочим их по возрастанию.
Какое число будет стоять между двумя другими?
Решение этой задачи на С++ могло бы выглядеть так:

```cpp
#include <iostream>
#include <algorithm>

using namespace std;

int main()
{
    int a[3];
    for (int i = 0; i < 3; ++i) cin >> a[i];
    sort(a, a + 3);
    cout << a[1] << endl;
    return 0;
}
```

## Формат ввода

В единственной строке записаны три целых числа a, b, c (−1000≤a,b,c≤1000), числа разделены одиночными пробелами.

## Формат вывода

Выведите число, которое будет стоять между двумя другими после упорядочивания.

<table>
 <tr>
    <td>Ограничение времени</td>
    <td>1 c</td>
 </tr>
 <tr>
    <td>Ограничение памяти</td>
    <td>256 Mb</td>
 </tr>
</table>

### Пример 1

Ввод

    1 2 3
    

Вывод

    2   

### Пример 2

Ввод

    1000 -1000 0
    

Вывод

    0
    
### Пример 3

Ввод

    3 1 3
    

Вывод

    3

